{
  "blogs": [
    {
      "title": "Why i disliked attempting JEE!",
      "author": "madam curie",
      "body": "The Joint Entrance Examination (JEE) is an engineering entrance assessment conducted for admission to various engineering colleges in India. It is constituted by two different examinations: the JEE-Main and the JEE-Advanced.The Joint Seat Allocation Authority (JoSAA) conducts the joint admission process for a total of 23 Indian Institutes of Technology (IITs), 31 National Institutes of Technology (NITs), 25 Indian Institutes of Information Technology (IIITs) campuses and other Government Funded Technical Institutes (GFTIs) based on the rank obtained by a student in JEE-Main or JEE-Advanced, depending on the engineering college.[1]There are some institutes, such as the Indian Institutes of Science Education and Research (IISERs), the Indian Institute of Petroleum and Energy (IIPE), the Rajiv Gandhi Institute of Petroleum Technology (RGIPT), the Indian Institute of Space Science and Technology (IIST), and the Indian Institute of Science (IISc), which use the score obtained in the JEE-Advanced examination as the basis for admission,[2][3] but are not a part of the Joint Seat Allocation Authority (JoSAA) counselling process. Any student who takes admission to an Indian Institute of Technology cannot appear for the JEE-Advanced examination again, but the same is not the case with NIT, IISc, IISERs, RGIPT, IIPE, and IIST.JEE-Main is conducted by National Testing Agency (NTA). JEE-Main has two papers, Paper-I and Paper-II. Candidates may opt for either or both of them. Both papers contain multiple choice questions. Paper-I is for admission to B.E./B.Tech courses and is conducted in a Computer Based Test mode. Paper-II is for admission in B.Arch and B.Planning courses and will also be conducted in Computer Based Test mode except for one paper, namely the 'Drawing Test' which shall be conducted in Pen and Paper mode or offline mode. From January 2020 onwards, an additional Paper-III is being introduced for B.Planning courses separately.[4]Due to the COVID-19 pandemic in 2020, JEE-Main 2021 has a change in paper format and number of attempts. Now there will be 20 single choice questions and 10 numerical questions out of which only five numerical questions are to be attempted. The marking scheme is same as earlier i.e. for SCQs, +4 marks for correct answer and -1 marks for incorrect answer and 0 marks for not answered, and for numerical type questions, +4 marks for correct and -1 marks for incorrect.[5][6]JEE-Main, unlike JEE-Advanced, has a fixed exam structure and is not subject to change every year. Up until 2018, the JEE-Main Paper-I is of three hours duration and consists of thirty single choice questions in each of the three subjects (physics, chemistry and maths). 4 marks are awarded for correct answers and 1 mark is deducted for incorrect answers. Students taking this exam are usually in the age group 18-20.A new pattern consisting of 20+5 questions per subject was introduced in January 2020 with 20 single choice questions + 5 numerical type questions by NTA. In single-choice questions 4 marks are awarded for correct answers and no marks are deducted from numerical type questions.[7]From 2013 to 2016, the marks obtained in the class XII school board examination used to be accorded a 40% weightage in deciding the JEE-Main all India ranks.[8][9]",
      "id": "1"
    },
    {
      "title": "what happens when someone is too ambitious",
      "body": "Life is a quality that distinguishes matter that has biological processes, such as signaling and self-sustaining processes, from matter that does not, and is defined descriptively by the capacity for homeostasis, organisation, metabolism, growth, adaptation, response to stimuli, and reproduction. Many philosophical definitions of living systems have been proposed, such as self-organizing systems. Viruses in particular make definition difficult as they replicate only in host cells. Life exists all over the Earth in air, water, and soil, with many ecosystems forming the biosphere. Some of these are harsh environments occupied only by extremophiles. Life has been studied since ancient times, with theories such as Empedocles's materialism asserting that it was composed of four eternal elements, and Aristotle's hylomorphism asserting that living things have souls and embody both form and matter. Life originated at least 3.5 billion years ago, resulting in a universal common ancestor. This evolved into all the species that exist now, by way of many extinct species, some of which have left traces as fossils. Attempts to classify living things, too, began with Aristotle. Modern classification began with Carl Linnaeus's system of binomial nomenclature in the 1740s. Living things are composed of biochemical molecules, formed mainly from a few core chemical elements. All living things contain two types of large molecule, proteins and nucleic acids, the latter usually both DNA and RNA: these carry the information needed by each species, including the instructions to make each type of protein. The proteins, in turn, serve as the machinery which carries out the many chemical processes of life. The cell is the structural and functional unit of life. Smaller organisms, including prokaryotes (bacteria and archaea), consist of small single cells. Larger organisms, mainly eukaryotes, can consist of single cells or may be multicellular with more complex structure. Life is only known to exist on Earth but extraterrestrial life is thought probable. Artificial life is being simulated and explored by scientists and engineers.",
      "author": "albert enstein",
      "id": "2"
    },
    {
      "title": "life is a rat race it tends to be happy sometimes",
      "body": "i really dont want to say this beacause i would never want my father to find out",
      "author": "sundar pichai",
      "id": "3"
    }
  ]
}